app/views/posts/index.html.erb

              </div>
              <% post.menus.each do |menu| %>
---
SELECT `menus`.* FROM `menus` WHERE `menus`.`post_id` = 1