app/controllers/menus_controller.rb

INSERT INTO `menus` (`training_type`, `created_at`, `updated_at`) VALUES (4, '2017-11-29 10:01:00', '2017-11-29 10:01:00')
---
  def create
    @menu =Menu.new(menu_params)
    @menu.save