app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts`
SELECT `menus`.* FROM `menus` WHERE `menus`.`post_id` = 1
---
  def index
    @posts = Post.all
    @menus = Menu.all

INSERT INTO `menus` (`training_type`, `count`, `user_id`, `post_id`, `created_at`, `updated_at`) VALUES (3, 200, 0, 15, '2017-11-29 13:02:22', '2017-11-29 13:02:22')
INSERT INTO `posts` (`title`, `user_id`, `created_at`, `updated_at`) VALUES ('ooooo', 1, '2017-11-29 12:27:33', '2017-11-29 12:27:33')
---
  def create
    #@post = Post.new(post_params)
    @post = current_user.posts.new(menu_params)
    # binding.pry
    @post.save